using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace LastExamen
{
    /// <summary>
    /// Interaction logic for TemperamentsInfo.xaml
    /// </summary>
    public partial class TemperamentsInfo : Window
    {
        public TemperamentsInfo(int i, Result res)
        {
            InitializeComponent();
            r = res;;
            if (i == 1)            
                Info.Text = "“Чистий” сангвінік має сильний, врівноважений, рухливий тип нервової системи, швидко пристосовується до нових умов, швидко сходиться з людьми, товариський. Почуття легко виникають і змінюються, емоційні переживання, як правило, неглибокі. Міміка багата, рухлива, виразна. Дещо непосидючий, потребує нових вражень, недостатньо регулює свої імпульси, не вміє дотримуватись виробленого розпорядку життя, системи у роботі. У зв’язку з цим не може успішно виконувати справи, що потребують рівної затрати сил, тривалої і методичної напруги, посидючості, сталості уваги, терпіння. За відсутності серйозних цілей, глибоких думок, творчої діяльності виробляються поверховість і мінливість.";
            else if(i == 2)
                Info.Text = "Флегматик має сильну, врівноважену, але інертну нервову систему. характеризується порівняно низьким рівнем активності в поведінці, нові форми якої виробляються поступово, але є стійкими. Поступливий та спокійний у діях, міміці і мові, вирізняється рівністю, постійністю, глибиною почуттів і настроїв. Він наполегливий та впертий “працівник життя”, він рідко “зривається”, не схильний до афектів, розрахувавши власні сили, доводить справу до кінця, рівний у відносинах, в міру товариський, не любить говорити зайвого, економить сили. Залежно від умов в одних випадках флегматик може характеризуватись “позитивними” рисами – витримкою, глибиною думок, сталістю, ґрунтовністю, в інших – млявістю, байдужістю до оточуючого, лінощами, бідністю і слабкістю емоцій, схильністю до виконання одних лише звичних дій.";
            else if (i == 3)
                Info.Text = "Холерик має сильну, але неврівноважену нервову систему, вирізняється підвищеною збудливістю. Йому властиві різкість і поривчастість рухів, сила, імпульсивність, яскрава виразність емоційних переживань. Внаслідок неврівноваженості, захопившись справою, схильний діяти з усіх сил, виснажуватись більше, ніж слід, але часто будь-яка дрібниця може звести все нанівець. Маючи позитивні суспільні інтереси, така людина виявляє темперамент у ініціативності, енергійності, принциповості. Але за їх відсутності холеричний темперамент часто виявляється у дратівливості, афективності, нестриманості, запальності, нездатності до самоконтролю за напружених обставин.";
            else if (i == 4)
                Info.Text = "Меланхолік вирізняється загальною слабкістю нервової системи. У меланхоліка реакція часто не відповідає силі подразника, наявна глибина і сталість почуттів при слабкому їх вираженні. Йому важко довго на чомусь зосереджуватись.\n Особливістю цього типу є швидкий розвиток позамежного гальмування під дією навіть помірних за силою подразників.Сильні впливи часто викликають у меланхоліка тривалу гальмівну реакцію(опускаються руки).Йому властиві стриманість та приглушеність моторики і мови, сором’язливість і боязкість, нерішучість.В нормальних умовах меланхолік – людина глибока, змістовна, може бути хорошим працівником, успішно вирішувати життєві завдання. За несприятливих умов може перетворитись на замкнену, боязку, тривожну, раниму людину, схильну до важких внутрішніх переживань таких життєвих обставин, які на те не заслуговують.Такі люди намагаються ізолювати себе від життя з його хвилюванням, уникають товариства, бояться будь-якої відповідальності.";
        }
        Result r;
        private void Button_Click(object sender, RoutedEventArgs e)
        {
            r.Show();
            this.Close();
        }
    }
}
